---
type: AnalysisDisplayLegend
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 2
tags: [revit-api, class]
---

# AnalysisDisplayLegend

`Autodesk.Revit.DB.Analysis.AnalysisDisplayLegend` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Height | 2011 | `public double Height { get ; set ; }` |
| Property | Parameter | — | `` |